Doukeyi-X/ALL-LOGIC/libsigrok4DSL/hardware/CH32/ch32_logic.c
/*
 * CH32H417 Logic Analyzer driver for DSView / libsigrok4DSL
 *
 * USB protocol (WCH CH32H417 firmware):
 *   VID 1A86
 *   PID 0x5537  USB2.0 High-Speed (USBHS)
 *   PID 0x5538  USB3.0 SuperSpeed (USBSS)  = USB2 PID + 1
 *   EP1 OUT/IN  command channel
 *   EP2 IN      logic sample stream
 *   EP3 IN      ADC sample stream (not used yet)
 *
 * Commands (bulk EP1):
 *   {Cmd, Len, Buf[5]}  request
 *   {Cmd|0x10, Len, Status, Buf[5]}  response
 */

#include <assert.h>
#include <errno.h>
#include <inttypes.h>
#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdint.h>

#include "../../libsigrok-internal.h"
#include "../../log.h"
#include "ch32_logic.h"
#include "ch32_vth_lut.h"

#undef LOG_PREFIX
#define LOG_PREFIX "ch32: "

#define CH32_VID                 0x1A86
#define CH32_PID_USB2            0x5537   /* High-Speed APP */
#define CH32_PID_USB3            0x5538   /* SuperSpeed APP (= USB2 + 1) */
/* Compat: older single-PID code paths */
#define CH32_PID                 CH32_PID_USB2

#define CH32_EP_CMD_OUT          0x01
#define CH32_EP_CMD_IN           0x81
#define CH32_EP_LOGIC_IN         0x82
#define CH32_EP_ADC_IN           0x83

#define CMD_SET_LOGIC_PARA       0xA0
#define CMD_SET_LOGIC_LEVEL      0xA1
#define CMD_SET_START            0xA2
#define CMD_SET_STOP             0xA3
#define CMD_GET_LOGIC_PARA       0xA4
#define CMD_GET_LOGIC_LEVEL      0xA5
#define CMD_GET_VERSION          0xAC
#define CMD_RETURN_PARA          0x10

/* HSADC (HADC) commands — EP3 stream */
#define CMD_SET_ADC_PARA         0xA6
#define CMD_SET_ADC_CHANNEL      0xA7
#define CMD_SET_ADC_START        0xA8
#define CMD_SET_ADC_STOP         0xA9
#define CMD_GET_ADC_PARA         0xAA
#define CMD_GET_ADC_CHANNEL      0xAB

/* CH32H417 HSADC product: 10-bit only, max 20 MS/s */
#define ADC_BIT_10               0x0a
#define ADC_CH0                  0x00
#define ADC_CH1                  0x01

/*
 * HSADC sample rate (calibrated with 100 Hz square on CH0):
 *   rate_Hz = 40e6 / (adc_div + 1)
 * Firmware comment said 80e6/(div+1) which is 2x high.
 * div=0 fails; div=1 → 20 MS/s (hardware max); 10-bit in LE u16.
 *
 * DSView ANALOG path (AnalogSnapshot + envelope) is 8-bit only and expects
 * interleaved samples for *all* SR_CHANNEL_ANALOG probes. Host converts
 * mono 10-bit EP3 stream → 8-bit interleaved before SR_DF_ANALOG.
 */
#define CH32_ADC_CLOCK_HZ        SR_MHZ(40)   /* calibrated base */
#define CH32_ADC_MAX_HZ          SR_MHZ(20)   /* div=1 */
#define CH32_ADC_MIN_DIV         1            /* 40/(1+1)=20M; div=0 invalid */
#define CH32_ADC_BITS            10           /* hardware */
#define CH32_ADC_BPS             2            /* raw EP3: LE u16 */
#define CH32_ADC_UI_BITS         8            /* DSView unit_bits / envelope */
#define CH32_ADC_UI_MID          128
#define CH32_ADC_VREF            3.3          /* unipolar map 0..Vref */

#define CH32_XFER_TIMEOUT_MS     1000
#define CH32_BULK_TIMEOUT_MS     200
#define CH32_NUM_TRANSFERS       8
#define CH32_TRANSFER_SIZE       (64 * 1024)

#define CH32_DEFAULT_SAMPLES     SR_Mn(1)
#define CH32_HW_DEPTH            SR_Mn(16)

/* DSView LA_CROSS_DATA: 64 samples per channel plane block (8 bytes). */
#define CH32_CROSS_SCALE         64
#define CH32_CROSS_PLANE_BYTES   8
#define CH32_MAX_PHYS_CH         16

enum {
	CH32_ST_IDLE = 0,
	CH32_ST_START,
	CH32_ST_DATA,
	CH32_ST_STOP,
	CH32_ST_FINISH,
	CH32_ST_ERROR,
};

struct ch32_samplerate_entry {
	uint8_t logic_sys;
	uint64_t rate;
};

/* Hardware rates from firmware Set_Logic_Para_Fun() (USB3).
 * Lowest HW: logic_sys 0x17 → PLL 400M / DIV64 = 6.25 MS/s. */
static const struct ch32_samplerate_entry ch32_hw_rates[] = {
	{ 0x00, SR_MHZ(200) },
	{ 0x01, SR_MHZ(187) + SR_KHZ(500) },
	{ 0x02, SR_MHZ(175) },
	{ 0x03, SR_MHZ(162) + SR_KHZ(500) },
	{ 0x04, SR_MHZ(156) + SR_KHZ(250) },
	{ 0x05, SR_MHZ(150) },
	{ 0x06, SR_MHZ(137) + SR_KHZ(500) },
	{ 0x07, SR_MHZ(125) },
	{ 0x08, SR_MHZ(112) + SR_KHZ(500) },
	{ 0x09, SR_MHZ(100) },
	{ 0x0a, SR_MHZ(93) + SR_KHZ(750) },
	{ 0x0b, SR_MHZ(87) + SR_KHZ(500) },
	{ 0x0c, SR_MHZ(81) + SR_KHZ(250) },
	{ 0x0d, SR_MHZ(78) + SR_KHZ(125) },
	{ 0x0e, SR_MHZ(75) },
	{ 0x0f, SR_MHZ(68) + SR_KHZ(750) },
	{ 0x10, SR_MHZ(50) },
	{ 0x11, SR_MHZ(40) },
	{ 0x12, SR_MHZ(25) },
	{ 0x13, SR_MHZ(20) },
	{ 0x14, SR_MHZ(12) + SR_KHZ(500) },
	{ 0x15, SR_MHZ(10) },
	{ 0x16, SR_MHZ(8) },
	{ 0x17, SR_MHZ(6) + SR_KHZ(250) }, /* DIV64 min */
};

/*
 * UI sample-rate list only: common integer MHz (high → low).
 * Odd HW PLL rates (187.5 / 156.25 / …) stay in ch32_hw_rates for
 * mapping, but are not shown in the combobox.
 */
static const uint64_t ch32_ui_rates[] = {
	SR_MHZ(200),
	SR_MHZ(100),
	SR_MHZ(50),
	SR_MHZ(40),
	SR_MHZ(25),
	SR_MHZ(20),
	SR_MHZ(10),
	SR_MHZ(5),
	SR_MHZ(2),
	SR_MHZ(1),
};

/* Host minimum selectable sample rate. */
#define CH32_UI_RATE_MIN   SR_MHZ(1)

/* HADC UI rates: hardware max 20 MS/s, integer MHz only. */
static const uint64_t ch32_adc_ui_rates[] = {
	SR_MHZ(20),
	SR_MHZ(10),
	SR_MHZ(5),
	SR_MHZ(2),
	SR_MHZ(1),
};

/* Fallback static list (demo / no-device). */
static uint64_t ch32_samplerate_list[ARRAY_SIZE(ch32_ui_rates) + 1];
static int ch32_samplerate_count;

/* Analog probe options (DAQ). */
static const int32_t ch32_probe_options[] = {
	SR_CONF_PROBE_COUPLING,
	SR_CONF_PROBE_VDIV,
	SR_CONF_PROBE_MAP_DEFAULT,
	SR_CONF_PROBE_MAP_UNIT,
	SR_CONF_PROBE_MAP_MIN,
	SR_CONF_PROBE_MAP_MAX,
};

static const uint64_t ch32_vdivs[] = {
	SR_mV(10), SR_mV(20), SR_mV(50), SR_mV(100), SR_mV(200),
	SR_mV(500), SR_V(1), SR_V(2), 0,
};

static const char *ch32_coupling[] = { "DC", "AC", NULL };
static const char *ch32_map_units[] = { "V", NULL };

enum {
	CH32_CHMODE_16 = 0,
	CH32_CHMODE_8 = 1,
};

static const struct sr_list_item filter_list[] = {
	{ SR_FILTER_NONE, "None" },
	{ SR_FILTER_1T, "1 Sample Clock" },
	{ -1, NULL },
};

/* CH32 is continuous USB stream only (no on-device DRAM buffer mode). */
static const struct sr_list_item opmode_list[] = {
	{ LO_OP_STREAM, "Stream Mode" },
	{ -1, NULL },
};

static struct sr_list_item channel_mode_list[] = {
	{ CH32_CHMODE_16, "Use 16 Channels" },
	{ CH32_CHMODE_8, "Use 8 Channels" },
	{ -1, NULL },
};

static const char *maxHeights[] = { "1X", "2X", "3X", "4X", "5X" };

/* Device options panel (like DSLogic). */
static const int32_t hwoptions[] = {
	SR_CONF_OPERATION_MODE,
	SR_CONF_FILTER,
	SR_CONF_VTH,
	SR_CONF_MAX_HEIGHT,
};

/* Session / device-option keys that UI persists. */
static const int32_t sessions[] = {
	SR_CONF_MAX_HEIGHT,
	SR_CONF_OPERATION_MODE,
	SR_CONF_CHANNEL_MODE,
	SR_CONF_SAMPLERATE,
	SR_CONF_LIMIT_SAMPLES,
	SR_CONF_VTH,
	SR_CONF_FILTER,
};

static const char *probe_names[] = {
	"0", "1", "2", "3", "4", "5", "6", "7",
	"8", "9", "10", "11", "12", "13", "14", "15",
	NULL,
};

struct ch32_context {
	struct libusb_device *usb_dev;
	struct libusb_device_handle *devhdl;
	struct sr_context *sr_ctx;

	uint8_t logic_bit;     /* 8 or 16: UHSIF parallel width */
	uint8_t logic_sys;     /* firmware rate index */
	uint16_t logic_level;  /* DAC value */
	uint8_t sw_ver;
	uint8_t hw_ver;

	uint64_t samplerate;      /* effective rate shown to UI */
	uint64_t hw_samplerate;   /* actual hardware capture rate */
	int decimate_n;           /* keep 1 of N raw samples (soft downsample) */
	int decimate_phase;

