Doukeyi-X/ALL-LOGIC/libsigrok4DSL/hardware/CH32/ch32_logic.c
	uint64_t limit_samples;
	uint64_t num_samples;
	uint64_t num_bytes;

	int channel_count;     /* 8 or 16 physical channels */
	int ch_mode;           /* CH32_CHMODE_8 / _16 */
	int filter;            /* SR_FILTER_NONE / SR_FILTER_1T */
	int max_height;
	double vth;
	int op_mode;           /* LO_OP_STREAM only */
	int is_loop;           /* 1 = rolling/loop: keep streaming past limit */
	enum libusb_speed usb_speed; /* actual link speed */
	uint16_t usb_pid;            /* 0x5537 USB2 / 0x5538 USB3 */

	/* HSADC / ANALOG: always 10-bit, max 20 MS/s */
	uint8_t adc_bit;       /* always ADC_BIT_10 */
	uint8_t adc_div;       /* firmware HSADC_ClockDivision, >= 3 */
	uint8_t adc_channel;   /* 0 or 1 (active HW channel) */
	int acq_analog;        /* 1 while running ADC EP3 stream */

	/* mono 10-bit → 8-bit interleaved expand buffer for DSView */
	uint8_t *analog_expand;
	int analog_expand_cap;

	/* software 1T glitch filter state */
	uint16_t filt_prev_in;
	uint16_t filt_prev_out;
	int filt_have_prev;

	int status;
	int abort;
	int fw_streaming; /* 1 while device capture LED/path is armed */
	int submitted_transfers;
	int num_transfers;
	struct libusb_transfer **transfers;
	int freewheel; /* 1 if using fd=-1 source */

	/* raw sample residual (incomplete 64-sample group) after convert path */
	uint8_t *raw_pending;
	int raw_pending_len;
	int raw_pending_cap;

	/* incomplete multi-byte sample across USB packet boundary (16-bit) */
	uint8_t stream_res[2];
	int stream_res_len;

	/* soft-decimation window (majority vote for digital downsample) */
	uint16_t *decim_win;
	int decim_win_cap;
	int decim_win_fill;

	/* converted LA_CROSS_DATA buffer */
	uint8_t *cross_buf;
	int cross_cap;

	/* enabled channel physical bit indices (probe->index) */
	uint8_t en_bits[CH32_MAX_PHYS_CH];
	int en_count;

	const struct sr_dev_inst *sdi;
};

SR_PRIV struct sr_dev_driver ch32_driver_info;
static struct sr_dev_driver *di = &ch32_driver_info;

/* -------------------- helpers -------------------- */

static uint64_t ch32_hw_min_rate(void)
{
	return ch32_hw_rates[ARRAY_SIZE(ch32_hw_rates) - 1].rate;
}

/* Chip supports USB3; warn if plugged into USB2-only port. */
static int ch32_usb30_capable(void)
{
	return 1;
}

static int ch32_is_usb3_link(const struct ch32_context *devc)
{
	return devc && (devc->usb_speed == LIBUSB_SPEED_SUPER ||
			devc->usb_speed == LIBUSB_SPEED_SUPER_PLUS);
}

/*
 * Firmware Set_Logic_Para_Fun() on USB2 forces fixed UHSIF clock:
 *   8-bit  → DIV10 @ 400M ≈ 40 MS/s
 *   16-bit → DIV20 @ 400M ≈ 20 MS/s
 * USB3 uses full programmable rate table (up to 200 MS/s).
 */
static uint64_t ch32_link_max_hw_rate(const struct ch32_context *devc)
{
	if (ch32_is_usb3_link(devc))
		return ch32_hw_rates[0].rate; /* 200M */
	if (devc && devc->logic_bit == 8)
		return SR_MHZ(40);
	return SR_MHZ(20);
}

static const char *ch32_speed_name(enum libusb_speed sp)
{
	switch (sp) {
	case LIBUSB_SPEED_LOW: return "LOW";
	case LIBUSB_SPEED_FULL: return "FULL";
	case LIBUSB_SPEED_HIGH: return "HIGH(USB2.0)";
	case LIBUSB_SPEED_SUPER: return "SUPER(USB3.0)";
	case LIBUSB_SPEED_SUPER_PLUS: return "SUPER+(USB3.x)";
	default: return "UNKNOWN";
	}
}

static int ch32_is_app_pid(uint16_t pid)
{
	return (pid == CH32_PID_USB2 || pid == CH32_PID_USB3);
}

static void ch32_apply_model_name(struct sr_dev_inst *sdi,
				  enum libusb_speed sp)
{
	const char *model;

	if (!sdi)
		return;
	if (sp == LIBUSB_SPEED_SUPER || sp == LIBUSB_SPEED_SUPER_PLUS)
		model = "CH32H417 LA USB3.0";
	else if (sp == LIBUSB_SPEED_HIGH)
		model = "CH32H417 LA USB2.0";
	else
		model = "CH32H417 Logic Analyzer";

	g_free(sdi->name);
	sdi->name = g_strdup(model);
}

/*
 * Primary: firmware PID
 *   0x5537 → USB2.0 High-Speed
 *   0x5538 → USB3.0 SuperSpeed
 * Fallback: libusb_get_device_speed / bcdUSB if PID unknown.
 */
static void ch32_update_usb_speed(struct ch32_context *devc)
{
	enum libusb_speed sp = LIBUSB_SPEED_UNKNOWN;
	enum libusb_speed sp_lib = LIBUSB_SPEED_UNKNOWN;
	struct libusb_device_descriptor des;
	uint16_t bcd = 0;
	uint16_t pid = 0;

	if (!devc || !devc->usb_dev)
		return;

	sp_lib = libusb_get_device_speed(devc->usb_dev);

	if (libusb_get_device_descriptor(devc->usb_dev, &des) == 0) {
		bcd = des.bcdUSB;
		pid = des.idProduct;
		devc->usb_pid = pid;
	} else {
		pid = devc->usb_pid;
	}

	if (pid == CH32_PID_USB3) {
		/* USB3 stack enumeration: treat as SuperSpeed for rate/UI */
		sp = LIBUSB_SPEED_SUPER;
		if (sp_lib == LIBUSB_SPEED_SUPER_PLUS)
			sp = LIBUSB_SPEED_SUPER_PLUS;
	} else if (pid == CH32_PID_USB2) {
		sp = LIBUSB_SPEED_HIGH;
		if (sp_lib == LIBUSB_SPEED_FULL)
			sp = LIBUSB_SPEED_FULL;
	} else if (sp_lib == LIBUSB_SPEED_SUPER ||
		   sp_lib == LIBUSB_SPEED_SUPER_PLUS) {
		sp = sp_lib;
	} else if ((bcd >> 8) >= 3) {
		sp = LIBUSB_SPEED_SUPER;
	} else if ((bcd >> 8) == 2) {
		sp = (sp_lib == LIBUSB_SPEED_FULL) ? LIBUSB_SPEED_FULL
						   : LIBUSB_SPEED_HIGH;
	} else {
		sp = sp_lib;
	}

	devc->usb_speed = sp;
	if (devc->sdi)
		ch32_apply_model_name((struct sr_dev_inst *)devc->sdi, sp);

	sr_info("CH32 USB: pid=0x%04x speed=%s (%d) libusb=%d bcdUSB=0x%04x max_hw=%" PRIu64 " S/s",
		pid, ch32_speed_name(sp), (int)sp, (int)sp_lib, bcd,
		ch32_link_max_hw_rate(devc));
}

/*
 * Synthesize UI sample rate from firmware rates via integer soft-decimation:
 *   effective = hw_rate / N   (N >= 1, host keeps 1 of every N raw samples)
 *
 * Never drop intermediate frequencies: pick (hw_rate, N) minimizing
 * |hw/N - want|, constrained by link max and UI min (1 MS/s).
 * Ties: smaller N (less phase jitter), then lower hw (less USB bandwidth).
 */
static void ch32_map_samplerate(struct ch32_context *devc, uint64_t want)
{
	unsigned int i;
	uint8_t best_sys = 0x17;
	uint64_t best_hw = ch32_hw_min_rate();
	uint64_t best_eff = CH32_UI_RATE_MIN;
	uint64_t best_err = UINT64_MAX;
	int best_n = 1;
	uint64_t link_max = ch32_link_max_hw_rate(devc);
	int usb3 = ch32_is_usb3_link(devc);

	if (want == 0 || want < CH32_UI_RATE_MIN)
		want = CH32_UI_RATE_MIN;
	if (want > link_max)
		want = link_max;

	if (!usb3) {
		/* USB2: single fixed HW clock; only soft-decimate */
		uint64_t hw = link_max;
		int max_n = (int)(hw / CH32_UI_RATE_MIN);
		int n;

		if (max_n < 1)
			max_n = 1;
		for (n = 1; n <= max_n; n++) {
			uint64_t eff = hw / (uint64_t)n;
			uint64_t err = (eff > want) ? (eff - want) : (want - eff);
			if (err < best_err ||
			    (err == best_err && n < best_n)) {
				best_err = err;
				best_n = n;
				best_hw = hw;
				best_eff = eff;
			}
		}
		devc->logic_sys = 0x17;
		devc->hw_samplerate = best_hw;
		devc->decimate_n = best_n;
		devc->samplerate = best_eff;
		devc->decimate_phase = 0;
		return;
	}

	/* USB3: try every firmware rate × integer N */
	for (i = 0; i < ARRAY_SIZE(ch32_hw_rates); i++) {
		uint64_t hw = ch32_hw_rates[i].rate;
		int max_n, n;

		if (hw > link_max || hw < CH32_UI_RATE_MIN)
			continue;
		max_n = (int)(hw / CH32_UI_RATE_MIN);
		if (max_n < 1)
			max_n = 1;

