Doukeyi-X/ALL-LOGIC/libsigrok4DSL/hardware/CH32/ch32_logic.c
		/*
		 * Search N around hw/want first (cheap), then ensure N=1
		 * and neighbors are covered for exact HW picks.
		 */
		{
			int n0 = (int)((hw + want / 2) / want);
			int n_lo, n_hi;

			if (n0 < 1)
				n0 = 1;
			if (n0 > max_n)
				n0 = max_n;
			n_lo = n0 - 2;
			if (n_lo < 1)
				n_lo = 1;
			n_hi = n0 + 2;
			if (n_hi > max_n)
				n_hi = max_n;
			/* always include full range if small; else window + 1 */
			if (max_n <= 64) {
				n_lo = 1;
				n_hi = max_n;
			}

			for (n = n_lo; n <= n_hi; n++) {
				uint64_t eff = hw / (uint64_t)n;
				uint64_t err;

				if (eff < CH32_UI_RATE_MIN)
					continue;
				err = (eff > want) ? (eff - want) : (want - eff);
				if (err < best_err ||
				    (err == best_err && n < best_n) ||
				    (err == best_err && n == best_n &&
				     hw < best_hw)) {
					best_err = err;
					best_n = n;
					best_hw = hw;
					best_eff = eff;
					best_sys = ch32_hw_rates[i].logic_sys;
				}
			}
			/* N=1 always considered for exact hardware match */
			if (n_lo > 1) {
				uint64_t eff = hw;
				uint64_t err = (eff > want) ? (eff - want)
							    : (want - eff);
				if (err < best_err ||
				    (err == best_err && 1 < best_n) ||
				    (err == best_err && best_n == 1 &&
				     hw < best_hw)) {
					best_err = err;
					best_n = 1;
					best_hw = hw;
					best_eff = eff;
					best_sys = ch32_hw_rates[i].logic_sys;
				}
			}
		}
	}

	devc->logic_sys = best_sys;
	devc->hw_samplerate = best_hw;
	devc->decimate_n = best_n;
	devc->samplerate = best_eff;
	devc->decimate_phase = 0;
}

/* Insert rate into high→low unique list. */
static int ch32_rate_list_add(uint64_t *out, int n, int cap, uint64_t r)
{
	int i, j;

	if (r < CH32_UI_RATE_MIN || n >= cap)
		return n;
	for (i = 0; i < n; i++) {
		if (out[i] == r)
			return n;
		if (out[i] < r)
			break;
	}
	for (j = n; j > i; j--)
		out[j] = out[j - 1];
	out[i] = r;
	return n + 1;
}

/*
 * UI list: only common integer MHz ≤ link_max (min 1M).
 * Actual capture still maps via ch32_map_samplerate() onto HW + soft N.
 */
static void ch32_build_rate_list(const struct ch32_context *devc,
				 uint64_t *out, int *out_n)
{
	uint64_t link_max = ch32_link_max_hw_rate(devc);
	unsigned int i;
	int n = 0;
	const int cap = 32;

	for (i = 0; i < ARRAY_SIZE(ch32_ui_rates); i++) {
		if (ch32_ui_rates[i] <= link_max &&
		    ch32_ui_rates[i] >= CH32_UI_RATE_MIN)
			n = ch32_rate_list_add(out, n, cap, ch32_ui_rates[i]);
	}

	/* USB2 8ch max 40M already in list; ensure link_max itself if missing */
	if (link_max >= CH32_UI_RATE_MIN)
		n = ch32_rate_list_add(out, n, cap, link_max);

	out[n] = 0;
	*out_n = n;
}

/* Map UI ADC rate → adc_div; rate = 40M/(div+1), div>=1 so max 20M. */
static void ch32_map_adc_samplerate(struct ch32_context *devc, uint64_t want)
{
	unsigned int i;
	uint8_t best_div = 39; /* 1 MHz */
	uint64_t best_rate = CH32_UI_RATE_MIN;
	uint64_t best_err = UINT64_MAX;

	if (want == 0 || want < CH32_UI_RATE_MIN)
		want = CH32_UI_RATE_MIN;
	if (want > CH32_ADC_MAX_HZ)
		want = CH32_ADC_MAX_HZ;

	for (i = CH32_ADC_MIN_DIV; i < 80; i++) {
		uint64_t r = CH32_ADC_CLOCK_HZ / (uint64_t)(i + 1);
		uint64_t err;

		if (r < CH32_UI_RATE_MIN)
			break;
		if (r > CH32_ADC_MAX_HZ)
			continue;
		err = (r > want) ? (r - want) : (want - r);
		if (err < best_err) {
			best_err = err;
			best_div = (uint8_t)i;
			best_rate = r;
		}
	}
	devc->adc_div = best_div;
	devc->hw_samplerate = best_rate;
	devc->samplerate = best_rate;
	devc->decimate_n = 1;
}

static void ch32_build_adc_rate_list(uint64_t *out, int *out_n)
{
	unsigned int i;
	int n = 0;
	const int cap = 16;

	for (i = 0; i < ARRAY_SIZE(ch32_adc_ui_rates); i++)
		n = ch32_rate_list_add(out, n, cap, ch32_adc_ui_rates[i]);
	out[n] = 0;
	*out_n = n;
}

static void ch32_apply_channel_mode(struct sr_dev_inst *sdi)
{
	struct ch32_context *devc = sdi->priv;
	GSList *l;
	int n = (devc->ch_mode == CH32_CHMODE_8) ? 8 : 16;

	devc->channel_count = n;
	devc->logic_bit = (n <= 8) ? 8 : 16;

	for (l = sdi->channels; l; l = l->next) {
		struct sr_channel *ch = l->data;
		if (ch->type != SR_CHANNEL_LOGIC)
			continue;
		ch->enabled = (ch->index < n) ? TRUE : FALSE;
	}
}

static int ch32_cmd(struct ch32_context *devc, uint8_t cmd,
		    const uint8_t *payload, uint8_t plen,
		    uint8_t *rsp, int *rsp_len)
{
	uint8_t buf[32];
	uint8_t rbuf[64];
	int xfer = 0;
	int r;

	if (!devc || !devc->devhdl)
		return SR_ERR;

	memset(buf, 0, sizeof(buf));
	buf[0] = cmd;
	buf[1] = plen;
	if (payload && plen)
		memcpy(&buf[2], payload, plen > 5 ? 5 : plen);

	r = libusb_bulk_transfer(devc->devhdl, CH32_EP_CMD_OUT,
				 buf, 2 + (plen > 5 ? 5 : plen),
				 &xfer, CH32_XFER_TIMEOUT_MS);
	if (r != 0) {
		sr_err("cmd 0x%02X OUT failed: %s", cmd, libusb_error_name(r));
		return SR_ERR;
	}

	/* START/STOP (logic + ADC) have no reply payload (len=0 in FW) */
	if (cmd == CMD_SET_START || cmd == CMD_SET_STOP ||
	    cmd == CMD_SET_ADC_START || cmd == CMD_SET_ADC_STOP)
		return SR_OK;

	memset(rbuf, 0, sizeof(rbuf));
	xfer = 0;
	r = libusb_bulk_transfer(devc->devhdl, CH32_EP_CMD_IN,
				 rbuf, sizeof(rbuf), &xfer, CH32_XFER_TIMEOUT_MS);
	if (r != 0) {
		sr_err("cmd 0x%02X IN failed: %s", cmd, libusb_error_name(r));
		return SR_ERR;
	}

	if (rsp && rsp_len) {
		int n = (xfer > 64) ? 64 : xfer;
		memcpy(rsp, rbuf, n);
		*rsp_len = n;
	}
	return SR_OK;
}

static int ch32_apply_logic_params(struct ch32_context *devc)
{
	uint8_t p[2];
	p[0] = devc->logic_bit;
	p[1] = devc->logic_sys;
	return ch32_cmd(devc, CMD_SET_LOGIC_PARA, p, 2, NULL, NULL);
}

/*
 * Comparator threshold DAC (CMD 0xA1).
 * Uses measured inverse LUT from tools/calibrate_ch32_vth.c
 * (HSADC0 full sweep DAC 0..1024 → v_pin). Non-linear; do not use V/3.3*N.
 *
 *   DAC 0    ≈ 3.44 V
 *   DAC 1024 ≈ 0.43 V
 */
#define CH32_VTH_MAX_V   3.44
#define CH32_VTH_MIN_V   0.43

static uint16_t ch32_vth_to_dac(double v)
{
	int mv;

	if (v >= CH32_VTH_MAX_V)
		return 0; /* highest threshold */
	if (v <= CH32_VTH_MIN_V)
		return ch32_vth_mv_to_dac[0]; /* lowest in LUT (~DAC 1023) */
	mv = (int)(v * 1000.0 + 0.5);
	if (mv < 0)
		mv = 0;
	if (mv > CH32_VTH_LUT_MV_MAX)
		mv = CH32_VTH_LUT_MV_MAX;
	return ch32_vth_mv_to_dac[mv];
}

static void ch32_set_vth(struct ch32_context *devc, double v)
{
	if (v > CH32_VTH_MAX_V)
		v = CH32_VTH_MAX_V;
	if (v < CH32_VTH_MIN_V)
		v = CH32_VTH_MIN_V;
	devc->vth = v;
	devc->logic_level = ch32_vth_to_dac(v);
}

static int ch32_apply_level(struct ch32_context *devc)
{
	uint8_t p[2];

