Doukeyi-X/ALL-LOGIC/libsigrok4DSL/hardware/CH32/ch32_logic.c
	/* keep DAC in sync with current vth */
	devc->logic_level = ch32_vth_to_dac(devc->vth);
	p[0] = (uint8_t)(devc->logic_level >> 8);
	p[1] = (uint8_t)(devc->logic_level & 0xff);
	sr_info("VTH apply: %.3f V → DAC %u (HSADC0 cal LUT)",
		devc->vth, (unsigned)devc->logic_level);
	return ch32_cmd(devc, CMD_SET_LOGIC_LEVEL, p, 2, NULL, NULL);
}

static int ch32_apply_adc_params(struct ch32_context *devc)
{
	uint8_t p[2];
	/* Always force 10-bit (hardware product spec) */
	devc->adc_bit = ADC_BIT_10;
	if (devc->adc_div < CH32_ADC_MIN_DIV)
		devc->adc_div = CH32_ADC_MIN_DIV;
	p[0] = devc->adc_bit;
	p[1] = devc->adc_div;
	return ch32_cmd(devc, CMD_SET_ADC_PARA, p, 2, NULL, NULL);
}

static int ch32_apply_adc_channel(struct ch32_context *devc)
{
	uint8_t p[1];
	p[0] = devc->adc_channel;
	return ch32_cmd(devc, CMD_SET_ADC_CHANNEL, p, 1, NULL, NULL);
}

static void ch32_sync_adc_channel_from_probes(struct sr_dev_inst *sdi)
{
	struct ch32_context *devc = sdi->priv;
	GSList *l;

	for (l = sdi->channels; l; l = l->next) {
		struct sr_channel *ch = l->data;
		if (ch->type == SR_CHANNEL_ANALOG && ch->enabled) {
			devc->adc_channel = (ch->index == 1) ? ADC_CH1 : ADC_CH0;
			return;
		}
	}
	devc->adc_channel = ADC_CH0;
}

static void ch32_setup_logic_probes(struct sr_dev_inst *sdi)
{
	int i;

	sr_dev_probes_free(sdi);
	for (i = 0; i < 16; i++) {
		sdi->channels = g_slist_append(sdi->channels,
			sr_channel_new(i, SR_CHANNEL_LOGIC, TRUE, probe_names[i]));
	}
	ch32_apply_channel_mode(sdi);
}

static void ch32_setup_analog_probes(struct sr_dev_inst *sdi)
{
	struct ch32_context *devc = sdi->priv;
	int i;
	/* UI path is 8-bit (envelope + AnalogSnapshot); mid-code = 128 */
	const int bits = CH32_ADC_UI_BITS;
	uint16_t mid = (uint16_t)CH32_ADC_UI_MID;

	devc->adc_bit = ADC_BIT_10;
	sr_dev_probes_free(sdi);
	for (i = 0; i < 2; i++) {
		struct sr_channel *probe;
		char name[8];

		snprintf(name, sizeof(name), "A%d", i);
		probe = sr_channel_new(i, SR_CHANNEL_ANALOG, TRUE, name);
		if (!probe)
			continue;
		probe->bits = bits;
		/* Only one HW channel at a time; default enable A0 */
		probe->enabled = (i == (int)devc->adc_channel) ? TRUE : FALSE;
		probe->coupling = SR_DC_COUPLING;
		probe->vdiv = SR_V(1);
		probe->vfactor = 1;
		probe->hw_offset = mid;
		probe->offset = mid;
		probe->trig_value = mid;
		probe->map_default = TRUE;
		probe->map_unit = ch32_map_units[0];
		/* Unipolar 0..Vref; labels: top=Vref, bottom=0 */
		probe->map_min = 0.0;
		probe->map_max = CH32_ADC_VREF;
		sdi->channels = g_slist_append(sdi->channels, probe);
	}
}

/* Count all analog probes (enabled or not) — matches AnalogSnapshot packing. */
static int ch32_analog_probe_count(const struct sr_dev_inst *sdi)
{
	GSList *l;
	int n = 0;

	if (!sdi)
		return 0;
	for (l = sdi->channels; l; l = l->next) {
		struct sr_channel *ch = l->data;
		if (ch && ch->type == SR_CHANNEL_ANALOG)
			n++;
	}
	return n;
}

/*
 * Convert mono LE 10-bit EP3 samples → DSView 8-bit interleaved.
 * AnalogSnapshot first_payload counts *all* SR_CHANNEL_ANALOG channels and
 * treats data as: [ch0, ch1, ...] * unit_bytes per time step.
 * Only the active HW channel carries converted samples; others get mid.
 *
 * Invert to 8-bit so higher voltage draws toward the top of the plot
 * (DSView y grows downward with raw code; left scale puts map_max at top).
 */
static int ch32_analog_expand_feed(struct ch32_context *devc,
				   const uint8_t *raw, int raw_len)
{
	const struct sr_dev_inst *sdi = devc->sdi;
	struct sr_datafeed_packet packet;
	struct sr_datafeed_analog analog;
	GSList *probes = NULL;
	GSList *l;
	int n_ch;
	int active;
	int need;
	int nsamp;
	int i, c;
	int total_raw;
	const uint8_t *src;
	uint8_t *out;

	if (!sdi || raw_len <= 0)
		return SR_OK;

	n_ch = ch32_analog_probe_count(sdi);
	if (n_ch <= 0)
		n_ch = 1;
	active = (int)devc->adc_channel;
	if (active < 0 || active >= n_ch)
		active = 0;

	/* stitch residual odd byte from previous USB packet */
	total_raw = devc->stream_res_len + raw_len;
	if (total_raw < CH32_ADC_BPS) {
		if (raw_len > 0 && devc->stream_res_len < 2) {
			devc->stream_res[devc->stream_res_len] = raw[0];
			devc->stream_res_len++;
		}
		return SR_OK;
	}

	/* build contiguous raw view: residual + this packet (except new residual) */
	{
		int full = total_raw & ~1; /* even bytes only */
		int use_from_pkt = full - devc->stream_res_len;
		uint8_t *tmp = NULL;
		const uint8_t *merged;

		if (devc->stream_res_len) {
			tmp = g_try_malloc((size_t)full);
			if (!tmp)
				return SR_ERR_MALLOC;
			memcpy(tmp, devc->stream_res, (size_t)devc->stream_res_len);
			memcpy(tmp + devc->stream_res_len, raw, (size_t)use_from_pkt);
			merged = tmp;
		} else {
			merged = raw;
		}

		nsamp = full / CH32_ADC_BPS;
		need = nsamp * n_ch; /* 1 byte per ch per sample */
		if (need > devc->analog_expand_cap) {
			uint8_t *p = g_try_realloc(devc->analog_expand, (size_t)need);
			if (!p) {
				g_free(tmp);
				return SR_ERR_MALLOC;
			}
			devc->analog_expand = p;
			devc->analog_expand_cap = need;
		}
		out = devc->analog_expand;
		src = merged;

		for (i = 0; i < nsamp; i++) {
			uint16_t raw10 = (uint16_t)src[i * 2] |
					 ((uint16_t)src[i * 2 + 1] << 8);
			uint8_t u8;

			raw10 &= 0x3ff;
			/* 10-bit → 8-bit, invert for DSView top=high-V convention */
			u8 = (uint8_t)(255u - ((raw10 * 255u) / 1023u));
			for (c = 0; c < n_ch; c++)
				out[i * n_ch + c] =
					(c == active) ? u8 : (uint8_t)CH32_ADC_UI_MID;
		}

		/* new residual: last odd byte of this packet if any */
		if (total_raw & 1) {
			devc->stream_res[0] = raw[raw_len - 1];
			devc->stream_res_len = 1;
		} else {
			devc->stream_res_len = 0;
		}

		g_free(tmp);
	}

	if (nsamp <= 0)
		return SR_OK;

	for (l = sdi->channels; l; l = l->next) {
		struct sr_channel *ch = l->data;
		if (ch && ch->type == SR_CHANNEL_ANALOG)
			probes = g_slist_append(probes, ch);
	}
	if (!probes)
		return SR_OK;

	packet.type = SR_DF_ANALOG;
	packet.status = SR_PKT_OK;
	packet.payload = &analog;
	analog.probes = probes;
	analog.num_samples = (uint64_t)nsamp;
	analog.unit_bits = CH32_ADC_UI_BITS;
	analog.unit_pitch = 1;
	analog.mq = SR_MQ_VOLTAGE;
	analog.unit = SR_UNIT_VOLT;
	analog.mqflags = 0;
	analog.data = out;
	ds_data_forward(sdi, &packet);
	devc->num_samples += (uint64_t)nsamp;
	devc->num_bytes += (uint64_t)(nsamp * n_ch);
	g_slist_free(probes);
	return SR_OK;
}

/* Build enabled physical-bit list in UI channel order. */
static void ch32_refresh_enabled_bits(struct ch32_context *devc)
{
	GSList *l;
	int n = 0;
	int max_bit = (devc->logic_bit == 8) ? 8 : 16;

