Doukeyi-X/ALL-LOGIC/libsigrok4DSL/hardware/CH32/ch32_logic.c
	for (l = devc->sdi->channels; l; l = l->next) {
		struct sr_channel *ch = l->data;
		if (!ch->enabled)
			continue;
		if (ch->index >= max_bit)
			continue;
		if (n >= CH32_MAX_PHYS_CH)
			break;
		devc->en_bits[n++] = (uint8_t)ch->index;
	}
	if (n == 0) {
		/* fallback: all physical channels */
		int i;
		for (i = 0; i < max_bit; i++)
			devc->en_bits[i] = (uint8_t)i;
		n = max_bit;
	}
	devc->en_count = n;
}

/*
 * Convert CH32 raw parallel stream → DSView LA_CROSS_DATA.
 *
 * CH32 raw (UHSIF):
 *   8-bit:  [s0][s1][s2]... each byte = D7..D0 at one sample time
 *   16-bit: [s0_lo][s0_hi][s1_lo][s1_hi]... little-endian u16 = D15..D0
 *
 * LA_CROSS_DATA (DSView):
 *   For each block of 64 samples:
 *     [ch0 plane 8B][ch1 plane 8B]...[chN-1 plane 8B]
 *   plane bit i = sample i of that channel (LSB = earlier sample).
 */
static int ch32_ensure_cross_cap(struct ch32_context *devc, int need)
{
	uint8_t *p;
	if (need <= devc->cross_cap)
		return SR_OK;
	need = (need + 4095) & ~4095;
	p = g_try_realloc(devc->cross_buf, need);
	if (!p)
		return SR_ERR_MALLOC;
	devc->cross_buf = p;
	devc->cross_cap = need;
	return SR_OK;
}

static int ch32_ensure_pending_cap(struct ch32_context *devc, int need)
{
	uint8_t *p;
	if (need <= devc->raw_pending_cap)
		return SR_OK;
	need = (need + 1023) & ~1023;
	p = g_try_realloc(devc->raw_pending, need);
	if (!p)
		return SR_ERR_MALLOC;
	devc->raw_pending = p;
	devc->raw_pending_cap = need;
	return SR_OK;
}

static uint16_t ch32_load_sample(const uint8_t *p, int sample_bytes)
{
	if (sample_bytes == 1)
		return p[0];
	/* little-endian 16-bit parallel word */
	return (uint16_t)p[0] | ((uint16_t)p[1] << 8);
}

static void ch32_pending_push_sample(struct ch32_context *devc, uint16_t s,
				     int sample_bytes)
{
	if (sample_bytes == 1) {
		devc->raw_pending[devc->raw_pending_len++] = (uint8_t)s;
	} else {
		devc->raw_pending[devc->raw_pending_len++] =
			(uint8_t)(s & 0xff);
		devc->raw_pending[devc->raw_pending_len++] =
			(uint8_t)(s >> 8);
	}
}

/* Per-bit majority over N digital samples → one output sample. */
static uint16_t ch32_majority_sample(const uint16_t *win, int n)
{
	int b, i;
	uint16_t out = 0;
	int thr;

	if (n <= 1)
		return win[0];
	/* strict majority; for even N ties keep last sample's bit */
	thr = (n / 2) + 1;
	for (b = 0; b < 16; b++) {
		int ones = 0;
		for (i = 0; i < n; i++) {
			if ((win[i] >> b) & 1u)
				ones++;
		}
		if (ones >= thr)
			out |= (uint16_t)(1u << b);
		else if (ones * 2 == n) {
			/* tie: keep last sample bit (stable edge preference) */
			if ((win[n - 1] >> b) & 1u)
				out |= (uint16_t)(1u << b);
		}
	}
	return out;
}

static uint16_t ch32_apply_1t_filter(struct ch32_context *devc, uint16_t in)
{
	uint16_t outv;

	if (devc->filter != SR_FILTER_1T)
		return in;
	if (!devc->filt_have_prev) {
		devc->filt_prev_in = in;
		devc->filt_prev_out = in;
		devc->filt_have_prev = 1;
		return in;
	}
	if (in == devc->filt_prev_in)
		outv = in;
	else
		outv = devc->filt_prev_out;
	devc->filt_prev_in = in;
	devc->filt_prev_out = outv;
	return outv;
}

/*
 * Append USB raw samples into pending after:
 *  - reassemble multi-byte samples across packet boundaries
 *  - optional 1T glitch filter
 *  - soft decimation: majority-vote over N samples (not bare pick-1-of-N,
 *    which aliases digital edges into thin spikes)
 */
static int ch32_preprocess_append(struct ch32_context *devc,
				  const uint8_t *raw, int raw_len)
{
	const int sample_bytes = (devc->logic_bit == 8) ? 1 : 2;
	const uint8_t *p;
	int left;
	int n_est;
	uint8_t tmp[4];

	if (!raw || raw_len <= 0)
		return SR_OK;

	/* Merge stream residual (half sample from previous URB). */
	if (devc->stream_res_len > 0) {
		int need = sample_bytes - devc->stream_res_len;
		int take;

		if (need < 0)
			need = 0;
		take = (raw_len < need) ? raw_len : need;
		memcpy(devc->stream_res + devc->stream_res_len, raw, take);
		devc->stream_res_len += take;
		raw += take;
		raw_len -= take;
		if (devc->stream_res_len < sample_bytes) {
			/* still incomplete */
			return SR_OK;
		}
		/* one complete sample in stream_res, then rest of raw */
		memcpy(tmp, devc->stream_res, sample_bytes);
		devc->stream_res_len = 0;
		/* process this one sample first via recursive-style path */
		p = tmp;
		left = sample_bytes;
		/* fall through using concatenated view: handle tmp then raw */
		n_est = 1 + raw_len / sample_bytes;
		if (ch32_ensure_pending_cap(devc,
			devc->raw_pending_len + n_est * sample_bytes) != SR_OK)
			return SR_ERR_MALLOC;
		goto process_one_then_raw;
	}

	n_est = raw_len / sample_bytes;
	if (n_est <= 0) {
		/* only a partial sample in this packet */
		if (raw_len > 0 && raw_len < sample_bytes) {
			memcpy(devc->stream_res, raw, raw_len);
			devc->stream_res_len = raw_len;
		}
		return SR_OK;
	}

	if (ch32_ensure_pending_cap(devc,
		devc->raw_pending_len + n_est * sample_bytes) != SR_OK)
		return SR_ERR_MALLOC;

	p = raw;
	left = n_est * sample_bytes;
	/* save trailing partial */
	if (raw_len > left) {
		int rem = raw_len - left;
		memcpy(devc->stream_res, raw + left, rem);
		devc->stream_res_len = rem;
	}

	{
		int i, n_samples = left / sample_bytes;
		int N = devc->decimate_n > 1 ? devc->decimate_n : 1;

		if (N > 1) {
			if (!devc->decim_win || devc->decim_win_cap < N) {
				uint16_t *nw = g_try_realloc(devc->decim_win,
					(gsize)N * sizeof(uint16_t));
				if (!nw)
					return SR_ERR_MALLOC;
				devc->decim_win = nw;
				devc->decim_win_cap = N;
			}
		}

		for (i = 0; i < n_samples; i++) {
			uint16_t s = ch32_load_sample(p + i * sample_bytes,
						      sample_bytes);
			s = ch32_apply_1t_filter(devc, s);

			if (N <= 1) {
				ch32_pending_push_sample(devc, s, sample_bytes);
				continue;
			}

			/* Collect N samples, emit majority (anti-alias digital) */
			devc->decim_win[devc->decim_win_fill++] = s;
			if (devc->decim_win_fill >= N) {
				uint16_t m = ch32_majority_sample(devc->decim_win, N);
				ch32_pending_push_sample(devc, m, sample_bytes);
				devc->decim_win_fill = 0;
			}
		}
	}
	return SR_OK;

process_one_then_raw:
	{
		uint16_t s = ch32_load_sample(p, sample_bytes);
		int N = devc->decimate_n > 1 ? devc->decimate_n : 1;
		s = ch32_apply_1t_filter(devc, s);
		if (N <= 1) {
			ch32_pending_push_sample(devc, s, sample_bytes);
		} else {
			if (!devc->decim_win || devc->decim_win_cap < N) {
				uint16_t *nw = g_try_realloc(devc->decim_win,
					(gsize)N * sizeof(uint16_t));
				if (!nw)
					return SR_ERR_MALLOC;
				devc->decim_win = nw;
				devc->decim_win_cap = N;
			}
			devc->decim_win[devc->decim_win_fill++] = s;
			if (devc->decim_win_fill >= N) {
				uint16_t m = ch32_majority_sample(devc->decim_win, N);
				ch32_pending_push_sample(devc, m, sample_bytes);
				devc->decim_win_fill = 0;
			}
		}
		/* continue with remaining raw without residual (already merged) */
		if (raw_len > 0) {
			const uint8_t *save_raw = raw;
			int save_len = raw_len;
			/* recursive-style: process rest; residual already 0 */
			p = save_raw;
			left = (save_len / sample_bytes) * sample_bytes;
			if (save_len > left) {
				memcpy(devc->stream_res, save_raw + left,
				       save_len - left);
				devc->stream_res_len = save_len - left;
			}
			if (left > 0) {
				int i, n_samples = left / sample_bytes;
				for (i = 0; i < n_samples; i++) {
					s = ch32_load_sample(p + i * sample_bytes,
							     sample_bytes);
					s = ch32_apply_1t_filter(devc, s);
					if (N <= 1) {
						ch32_pending_push_sample(devc, s,
									 sample_bytes);
					} else {
						devc->decim_win[devc->decim_win_fill++] = s;
						if (devc->decim_win_fill >= N) {
							uint16_t m = ch32_majority_sample(
								devc->decim_win, N);
							ch32_pending_push_sample(devc, m,
										 sample_bytes);
							devc->decim_win_fill = 0;
						}
					}
				}
			}
		}
	}
	return SR_OK;
}

