Doukeyi-X/ALL-LOGIC/libsigrok4DSL/hardware/CH32/ch32_logic.c
/*
 * Send firmware STOP/ADC_STOP. Must NOT be called from a libusb transfer
 * callback (sync bulk re-enters the event loop). Safe from receive_data /
 * acquisition_stop / close.
 */
static void ch32_hw_stop(struct ch32_context *devc)
{
	int ret;

	if (!devc || !devc->fw_streaming)
		return;

	if (devc->acq_analog)
		ret = ch32_cmd(devc, CMD_SET_ADC_STOP, NULL, 0, NULL, NULL);
	else
		ret = ch32_cmd(devc, CMD_SET_STOP, NULL, 0, NULL, NULL);
	if (ret != SR_OK) {
		/* keep fw_streaming so receive_data can retry */
		sr_err("HW stop cmd failed, will retry");
		return;
	}
	devc->fw_streaming = 0;
	sr_info("HW stop sent (capture LED off)");
}

static void ch32_cancel_transfers(struct ch32_context *devc)
{
	unsigned int i;

	if (!devc || !devc->transfers)
		return;
	for (i = 0; i < (unsigned)devc->num_transfers; i++) {
		if (devc->transfers[i])
			libusb_cancel_transfer(devc->transfers[i]);
	}
}

/* Host-side stop: abort + cancel. HW STOP is deferred (see receive_data). */
static void ch32_request_acq_stop(struct ch32_context *devc)
{
	if (!devc || devc->abort)
		return;
	devc->abort = 1;
	devc->status = CH32_ST_STOP;
	ch32_cancel_transfers(devc);
}

/* Convert complete 64-sample groups from pending → LA_CROSS_DATA. */
static int ch32_convert_push(struct ch32_context *devc,
			     const uint8_t *raw, int raw_len)
{
	const int sample_bytes = (devc->logic_bit == 8) ? 1 : 2;
	const int en = devc->en_count;
	const int raw_group = CH32_CROSS_SCALE * sample_bytes;
	const int cross_group = CH32_CROSS_PLANE_BYTES * en;
	int groups, g, c, i, consumed, left;
	uint8_t *out;
	int out_len;
	struct sr_datafeed_packet packet;
	struct sr_datafeed_logic logic;
	uint64_t samples_out;

	if (en < 1 || raw_len <= 0)
		return SR_OK;

	if (ch32_preprocess_append(devc, raw, raw_len) != SR_OK)
		return SR_ERR_MALLOC;

	groups = devc->raw_pending_len / raw_group;
	if (groups <= 0)
		return SR_OK;

	/* Single/buffer: stop at sample limit. Loop/rolling: keep forwarding. */
	if (devc->limit_samples && !devc->is_loop) {
		uint64_t room = (devc->num_samples < devc->limit_samples)
			? (devc->limit_samples - devc->num_samples) : 0;
		int max_groups = (int)(room / CH32_CROSS_SCALE);
		if (max_groups <= 0) {
			/*
			 * Remaining room < one 64-sample plane: treat capture
			 * as complete so the host stops the device (LED).
			 */
			devc->num_samples = devc->limit_samples;
			return SR_OK;
		}
		if (groups > max_groups)
			groups = max_groups;
	}

	out_len = groups * cross_group;
	if (ch32_ensure_cross_cap(devc, out_len) != SR_OK)
		return SR_ERR_MALLOC;

	out = devc->cross_buf;
	for (g = 0; g < groups; g++) {
		const uint8_t *blk = devc->raw_pending + g * raw_group;
		for (c = 0; c < en; c++) {
			uint64_t plane = 0;
			uint8_t bit = devc->en_bits[c];
			for (i = 0; i < CH32_CROSS_SCALE; i++) {
				uint16_t s = ch32_load_sample(
					blk + i * sample_bytes, sample_bytes);
				if ((s >> bit) & 1u)
					plane |= (1ULL << i);
			}
			out[0] = (uint8_t)(plane);
			out[1] = (uint8_t)(plane >> 8);
			out[2] = (uint8_t)(plane >> 16);
			out[3] = (uint8_t)(plane >> 24);
			out[4] = (uint8_t)(plane >> 32);
			out[5] = (uint8_t)(plane >> 40);
			out[6] = (uint8_t)(plane >> 48);
			out[7] = (uint8_t)(plane >> 56);
			out += CH32_CROSS_PLANE_BYTES;
		}
	}

	samples_out = (uint64_t)groups * CH32_CROSS_SCALE;

	packet.type = SR_DF_LOGIC;
	packet.status = SR_PKT_OK;
	packet.payload = &logic;
	logic.length = (uint64_t)out_len;
	logic.format = LA_CROSS_DATA;
	logic.data_error = 0;
	logic.data = devc->cross_buf;
	ds_data_forward(devc->sdi, &packet);

	devc->num_samples += samples_out;
	devc->num_bytes += (uint64_t)out_len;

	/* Keep incomplete residual */
	consumed = groups * raw_group;
	left = devc->raw_pending_len - consumed;
	if (left > 0)
		memmove(devc->raw_pending, devc->raw_pending + consumed, left);
	devc->raw_pending_len = left;

	return SR_OK;
}

/* -------------------- transfer path -------------------- */

static void finish_acquisition(struct ch32_context *devc)
{
	struct sr_datafeed_packet packet;

	if (!devc || devc->status == CH32_ST_FINISH)
		return;

	/* drop residual incomplete 64-sample group */
	devc->raw_pending_len = 0;
	devc->abort = 1;

	/*
	 * Prefer HW stop from receive_data (outside transfer callback).
	 * Still try here if not yet stopped — best-effort; may fail if we
	 * are nested inside libusb_handle_events.
	 */
	ch32_hw_stop(devc);

	sr_info("send SR_DF_END, samples=%" PRIu64, devc->num_samples);
	packet.type = SR_DF_END;
	packet.status = SR_PKT_OK;
	packet.payload = NULL;
	ds_data_forward(devc->sdi, &packet);

	if (devc->transfers) {
		g_free(devc->transfers);
		devc->transfers = NULL;
	}
	devc->num_transfers = 0;
	devc->submitted_transfers = 0;
	devc->status = CH32_ST_FINISH;
}

static void free_transfer(struct libusb_transfer *transfer)
{
	struct ch32_context *devc = transfer->user_data;
	unsigned int i;

	g_free(transfer->buffer);
	transfer->buffer = NULL;
	libusb_free_transfer(transfer);

	if (!devc->transfers)
		return;

	for (i = 0; i < (unsigned)devc->num_transfers; i++) {
		if (devc->transfers[i] == transfer) {
			devc->transfers[i] = NULL;
			break;
		}
	}
	devc->submitted_transfers--;
	if (devc->submitted_transfers <= 0)
		finish_acquisition(devc);
}

static void LIBUSB_CALL receive_transfer(struct libusb_transfer *transfer)
{
	struct ch32_context *devc = transfer->user_data;
	int r;

	if (devc->status == CH32_ST_START)
		devc->status = CH32_ST_DATA;

	if (devc->abort)
		devc->status = CH32_ST_STOP;

	if (transfer->status != LIBUSB_TRANSFER_COMPLETED &&
	    transfer->status != LIBUSB_TRANSFER_TIMED_OUT) {
		if (!devc->abort)
			sr_err("transfer status %d", transfer->status);
		devc->status = CH32_ST_STOP;
	}

	if (devc->status == CH32_ST_DATA && transfer->actual_length > 0) {
		if (devc->acq_analog) {
			/* mono 10-bit EP3 → 8-bit interleaved SR_DF_ANALOG */
			if (ch32_analog_expand_feed(devc, transfer->buffer,
						    transfer->actual_length) != SR_OK) {
				sr_err("analog expand/feed failed");
				ch32_request_acq_stop(devc);
			}
		} else if (ch32_convert_push(devc, transfer->buffer,
					     transfer->actual_length) != SR_OK) {
			sr_err("format convert failed");
			ch32_request_acq_stop(devc);
		}

