Doukeyi-X/ALL-LOGIC/libsigrok4DSL/hardware/CH32/ch32_logic.c
		/*
		 * Natural end at sample limit: do NOT call ch32_cmd() here —
		 * sync bulk from a transfer callback can fail/reenter libusb.
		 * Abort + cancel; receive_data will send HW STOP after
		 * handle_events returns (clears capture LED).
		 */
		if (!devc->is_loop &&
		    devc->limit_samples &&
		    devc->num_samples >= devc->limit_samples)
			ch32_request_acq_stop(devc);
	}

	if (devc->status == CH32_ST_DATA && !devc->abort) {
		r = libusb_submit_transfer(transfer);
		if (r != 0) {
			sr_err("resubmit failed: %s", libusb_error_name(r));
			free_transfer(transfer);
		}
	} else {
		free_transfer(transfer);
	}
}

static int start_transfers(struct ch32_context *devc)
{
	int i;
	unsigned char *buf;
	struct libusb_transfer *xfer;
	uint8_t ep = devc->acq_analog ? CH32_EP_ADC_IN : CH32_EP_LOGIC_IN;

	devc->num_transfers = CH32_NUM_TRANSFERS;
	devc->submitted_transfers = 0;
	devc->transfers = g_try_malloc0(sizeof(struct libusb_transfer *) *
					devc->num_transfers);
	if (!devc->transfers)
		return SR_ERR_MALLOC;

	for (i = 0; i < devc->num_transfers; i++) {
		buf = g_try_malloc0(CH32_TRANSFER_SIZE);
		if (!buf)
			return SR_ERR_MALLOC;
		xfer = libusb_alloc_transfer(0);
		libusb_fill_bulk_transfer(xfer, devc->devhdl, ep,
					  buf, CH32_TRANSFER_SIZE,
					  receive_transfer, devc,
					  CH32_BULK_TIMEOUT_MS);
		if (libusb_submit_transfer(xfer) != 0) {
			sr_err("submit transfer %d (ep=0x%02x) failed", i, ep);
			g_free(buf);
			libusb_free_transfer(xfer);
			return SR_ERR;
		}
		devc->transfers[i] = xfer;
		devc->submitted_transfers++;
	}
	return SR_OK;
}

static int receive_data(int fd, int revents, const struct sr_dev_inst *sdi)
{
	struct ch32_context *devc = sdi->priv;
	struct drv_context *drvc = di->priv;
	struct timeval tv = { 0, 0 };
	int completed = 0;

	(void)fd;
	(void)revents;

	libusb_handle_events_timeout_completed(drvc->sr_ctx->libusb_ctx,
					       &tv, &completed);

	/*
	 * After transfer callbacks return: safe place for sync STOP.
	 * Natural sample-limit end only sets abort inside the callback.
	 */
	if (devc->fw_streaming && devc->abort)
		ch32_hw_stop(devc);

	if (devc->status == CH32_ST_FINISH) {
		ch32_hw_stop(devc);
		if (devc->freewheel)
			sr_session_source_remove(-1);
		return TRUE;
	}
	return TRUE;
}

/* -------------------- driver API -------------------- */

static int hw_init(struct sr_context *sr_ctx)
{
	unsigned int i, n = 0;
	/* UI combobox fallback: common integer MHz only */
	for (i = 0; i < ARRAY_SIZE(ch32_ui_rates); i++)
		ch32_samplerate_list[n++] = ch32_ui_rates[i];
	ch32_samplerate_list[n] = 0;
	ch32_samplerate_count = (int)n;
	return std_hw_init(sr_ctx, di, LOG_PREFIX);
}

static int hw_cleanup(void)
{
	safe_free(di->priv);
	return SR_OK;
}

static void setup_channels(struct sr_dev_inst *sdi, int count)
{
	int i;
	char name[8];

	while (sdi->channels) {
		struct sr_channel *ch = sdi->channels->data;
		sdi->channels = g_slist_delete_link(sdi->channels, sdi->channels);
		g_free(ch->name);
		g_free(ch);
	}

	for (i = 0; i < count; i++) {
		const char *n = probe_names[i] ? probe_names[i] : name;
		if (!probe_names[i])
			snprintf(name, sizeof(name), "%d", i);
		sdi->channels = g_slist_append(
			sdi->channels,
			sr_channel_new(i, SR_CHANNEL_LOGIC, TRUE, n));
	}
}

static GSList *hw_scan(GSList *options)
{
	struct drv_context *drvc;
	struct libusb_device **devlist;
	struct libusb_device_descriptor des;
	struct sr_dev_inst *sdi;
	struct ch32_context *devc;
	GSList *devices = NULL;
	int i, ret;

	(void)options;
	drvc = di->priv;
	if (!drvc || !drvc->sr_ctx)
		return NULL;

	libusb_get_device_list(drvc->sr_ctx->libusb_ctx, &devlist);
	if (!devlist)
		return NULL;

	for (i = 0; devlist[i]; i++) {
		if (libusb_get_device_descriptor(devlist[i], &des) != 0)
			continue;
		if (des.idVendor != CH32_VID || !ch32_is_app_pid(des.idProduct))
			continue;
		if (sr_usb_device_is_exists(devlist[i]))
			continue;

		devc = g_try_malloc0(sizeof(*devc));
		if (!devc)
			break;

		{
			uint8_t bus = libusb_get_bus_number(devlist[i]);
			uint8_t address = libusb_get_device_address(devlist[i]);
			struct sr_usb_dev_inst *usb_info;

			devc->usb_dev = libusb_ref_device(devlist[i]);
			devc->sr_ctx = drvc->sr_ctx;
			devc->usb_pid = des.idProduct;
			devc->logic_bit = 16;
			devc->ch_mode = CH32_CHMODE_16;
			devc->filter = SR_FILTER_NONE;
			devc->limit_samples = CH32_DEFAULT_SAMPLES;
			devc->channel_count = 16;
			devc->max_height = 1;
			/* ~1.65 V CMOS mid → DAC ≈ 805 (not 2048!) */
			ch32_set_vth(devc, 1.65);
			devc->op_mode = LO_OP_STREAM;
			devc->is_loop = 0;
			devc->decimate_n = 1;
			devc->usb_speed = LIBUSB_SPEED_UNKNOWN;
			devc->adc_bit = ADC_BIT_10; /* HSADC fixed 10-bit */
			devc->adc_div = 3; /* 10 MHz: 40/(3+1) */
			devc->adc_channel = ADC_CH0; /* A0 / PF8 */
			devc->acq_analog = 0;

			sdi = sr_dev_inst_new(LOGIC, SR_ST_INACTIVE,
					      "WCH", "CH32H417 Logic Analyzer", "1.0");
			if (!sdi) {
				libusb_unref_device(devc->usb_dev);
				g_free(devc);
				break;
			}
			sdi->driver = di;
			sdi->dev_type = DEV_TYPE_USB;
			sdi->priv = devc;
			devc->sdi = sdi;
			sdi->handle = (ds_device_handle)devc->usb_dev;
			/* USB2/USB3 decided by PID (5537/5538) */
			ch32_update_usb_speed(devc);
			/* default 100M on USB3; USB2 will clamp in map */
			ch32_map_samplerate(devc, SR_MHZ(100));
			/*
			 * Must set conn (bus/addr) like DSLogic so Windows
			 * hotplug reconnect can update the handle. Without
			 * it, USB2 re-plug often leaves a stale entry and
			 * the device "disappears" from the UI.
			 */
			usb_info = sr_usb_dev_inst_new(bus, address);
			if (usb_info) {
				usb_info->usb_dev = devc->usb_dev;
				sdi->conn = usb_info;
			} else {
				sdi->conn = NULL;
			}
			/* always create 16 probes; channel mode enables 8 or 16 */
			setup_channels(sdi, 16);
			ch32_apply_channel_mode(sdi);

			sr_info("Found CH32 LA 1A86:%04X bus=%u addr=%u handle=%p speed=%s name=%s",
				des.idProduct, bus, address, devc->usb_dev,
				ch32_speed_name(devc->usb_speed),
				sdi->name ? sdi->name : "?");
			devices = g_slist_append(devices, sdi);
		}
	}

	libusb_free_device_list(devlist, 0);
	(void)ret;
	return devices;
}

static const GSList *hw_dev_mode_list(const struct sr_dev_inst *sdi)
{
	(void)sdi;
	GSList *l = NULL;
	/* sr_mode_list order: [0]=LOGIC, [1]=ANALOG(daq), [2]=DSO */
	l = g_slist_append(l, (gpointer)&sr_mode_list[0]);
	l = g_slist_append(l, (gpointer)&sr_mode_list[1]);
	return l;
}

static int hw_dev_open(struct sr_dev_inst *sdi)
{
	struct ch32_context *devc = sdi->priv;
	uint8_t rsp[64];
	int rlen = 0;
	int r;

	if (sdi->status == SR_ST_ACTIVE)
		return SR_OK;

	r = libusb_open(devc->usb_dev, &devc->devhdl);
	if (r != 0) {
		sr_err("open failed: %s", libusb_error_name(r));
		if (r == LIBUSB_ERROR_NOT_SUPPORTED)
			ds_set_last_error(SR_ERR_DEVICE_NO_DRIVER);
		else
			ds_set_last_error(SR_ERR_DEVICE_IS_EXCLUSIVE);
		return SR_ERR;
	}

	if (libusb_kernel_driver_active(devc->devhdl, 0) == 1)
		libusb_detach_kernel_driver(devc->devhdl, 0);

