Doukeyi-X/ALL-LOGIC/libsigrok4DSL/hardware/CH32/ch32_logic.c
	r = libusb_claim_interface(devc->devhdl, 0);
	if (r != 0) {
		sr_err("claim failed: %s", libusb_error_name(r));
		libusb_close(devc->devhdl);
		devc->devhdl = NULL;
		ds_set_last_error(SR_ERR_DEVICE_IS_EXCLUSIVE);
		return SR_ERR;
	}

	if (ch32_cmd(devc, CMD_GET_VERSION, NULL, 0, rsp, &rlen) == SR_OK &&
	    rlen >= 5) {
		devc->sw_ver = rsp[3];
		devc->hw_ver = rsp[4];
		sr_info("CH32 version sw=%u hw=%u", devc->sw_ver, devc->hw_ver);
	}

	/* Re-read speed after open (product string more reliable with handle). */
	devc->sdi = sdi;
	ch32_update_usb_speed(devc);
	ch32_map_samplerate(devc, devc->samplerate ? devc->samplerate
						   : SR_MHZ(100));

	ch32_apply_logic_params(devc);
	ch32_apply_level(devc);

	sdi->status = SR_ST_ACTIVE;
	sr_info("CH32 open: name=\"%s\" speed=%s",
		sdi->name ? sdi->name : "?",
		ch32_speed_name(devc->usb_speed));
	return SR_OK;
}

static int hw_dev_close(struct sr_dev_inst *sdi)
{
	struct ch32_context *devc;

	if (!sdi || !sdi->priv)
		return SR_ERR;

	devc = sdi->priv;
	if (devc->devhdl) {
		if (sdi->status == SR_ST_ACTIVE) {
			devc->acq_analog = (sdi->mode == ANALOG) ? 1 : devc->acq_analog;
			/* force stop even if flag was lost */
			if (!devc->fw_streaming)
				devc->fw_streaming = 1;
			ch32_hw_stop(devc);
		}
		libusb_release_interface(devc->devhdl, 0);
		libusb_close(devc->devhdl);
		devc->devhdl = NULL;
	}
	sdi->status = SR_ST_INACTIVE;
	return SR_OK;
}

static int hw_dev_destroy(struct sr_dev_inst *sdi)
{
	struct ch32_context *devc;

	if (!sdi)
		return SR_ERR;

	hw_dev_close(sdi);
	devc = sdi->priv;
	if (devc) {
		if (devc->usb_dev)
			libusb_unref_device(devc->usb_dev);
		g_free(devc->raw_pending);
		g_free(devc->cross_buf);
		g_free(devc->decim_win);
		g_free(devc->analog_expand);
		g_free(devc);
		sdi->priv = NULL;
	}
	if (sdi->conn) {
		/* usb_dev already unref'd via priv */
		sr_usb_dev_inst_free(sdi->conn);
		sdi->conn = NULL;
	}
	sr_dev_inst_free(sdi);
	return SR_OK;
}

/*
 * Called from lib_main update_device_handle() after USB re-plug
 * (e.g. move from USB3 port to USB2 port).
 */
SR_PRIV void ch32_on_usb_reconnected(struct sr_dev_inst *sdi,
				     struct libusb_device *new_dev)
{
	struct ch32_context *devc;

	if (!sdi || !sdi->priv || !new_dev)
		return;
	if (!sdi->driver || !sdi->driver->name ||
	    strcmp(sdi->driver->name, "ch32-logic") != 0)
		return;

	devc = sdi->priv;
	if (devc->usb_dev)
		libusb_unref_device(devc->usb_dev);
	devc->usb_dev = libusb_ref_device(new_dev);
	devc->sdi = sdi;
	sdi->handle = (ds_device_handle)devc->usb_dev;
	ch32_update_usb_speed(devc);
	ch32_map_samplerate(devc, devc->samplerate ? devc->samplerate
						   : SR_MHZ(100));
	sr_info("CH32 reconnected: name=\"%s\" speed=%s max_hw=%" PRIu64,
		sdi->name ? sdi->name : "?",
		ch32_speed_name(devc->usb_speed),
		ch32_link_max_hw_rate(devc));
}

static int hw_dev_status_get(const struct sr_dev_inst *sdi,
			     struct sr_status *status, gboolean prg)
{
	(void)sdi;
	(void)prg;
	if (!status)
		return SR_ERR;
	memset(status, 0, sizeof(*status));
	return SR_OK;
}

static int config_get(int id, GVariant **data, const struct sr_dev_inst *sdi,
		      const struct sr_channel *ch,
		      const struct sr_channel_group *cg)
{
	struct ch32_context *devc;

	(void)ch;
	(void)cg;
	if (!sdi || !sdi->priv)
		return SR_ERR_ARG;
	devc = sdi->priv;

	switch (id) {
	case SR_CONF_SAMPLERATE:
		*data = g_variant_new_uint64(devc->samplerate);
		break;
	case SR_CONF_LIMIT_SAMPLES:
		*data = g_variant_new_uint64(devc->limit_samples);
		break;
	case SR_CONF_DEVICE_MODE:
		*data = g_variant_new_int16(sdi->mode);
		break;
	case SR_CONF_UNIT_BITS:
		if (sdi->mode == ANALOG)
			/* 8-bit UI stream (HW is 10-bit; see ch32_analog_expand_feed) */
			*data = g_variant_new_byte(CH32_ADC_UI_BITS);
		else
			*data = g_variant_new_byte(1);
		break;
	case SR_CONF_PROBE_VDIV:
		if (ch)
			*data = g_variant_new_uint64(ch->vdiv);
		else
			return SR_ERR_ARG;
		break;
	case SR_CONF_PROBE_FACTOR:
		if (ch)
			*data = g_variant_new_uint64(ch->vfactor);
		else
			return SR_ERR_ARG;
		break;
	case SR_CONF_PROBE_COUPLING:
		if (ch)
			*data = g_variant_new_byte(ch->coupling);
		else
			return SR_ERR_ARG;
		break;
	case SR_CONF_PROBE_HW_OFFSET:
		if (ch)
			*data = g_variant_new_uint16(ch->hw_offset);
		else
			return SR_ERR_ARG;
		break;
	case SR_CONF_PROBE_OFFSET:
		if (ch)
			*data = g_variant_new_uint16(ch->offset);
		else
			return SR_ERR_ARG;
		break;
	case SR_CONF_PROBE_MAP_DEFAULT:
		if (ch)
			*data = g_variant_new_boolean(ch->map_default);
		else
			return SR_ERR_ARG;
		break;
	case SR_CONF_PROBE_MAP_UNIT:
		if (ch)
			*data = g_variant_new_string(ch->map_unit ? ch->map_unit : "V");
		else
			return SR_ERR_ARG;
		break;
	case SR_CONF_PROBE_MAP_MIN:
		if (ch)
			*data = g_variant_new_double(ch->map_min);
		else
			return SR_ERR_ARG;
		break;
	case SR_CONF_PROBE_MAP_MAX:
		if (ch)
			*data = g_variant_new_double(ch->map_max);
		else
			return SR_ERR_ARG;
		break;
	case SR_CONF_MAX_HEIGHT:
		*data = g_variant_new_string(maxHeights[devc->max_height]);
		break;
	case SR_CONF_MAX_HEIGHT_VALUE:
		*data = g_variant_new_byte(devc->max_height);
		break;
	case SR_CONF_HW_DEPTH:
		*data = g_variant_new_uint64(CH32_HW_DEPTH);
		break;
	case SR_CONF_TOTAL_CH_NUM:
		*data = g_variant_new_int16(16);
		break;
	case SR_CONF_VLD_CH_NUM:
		*data = g_variant_new_int16(devc->channel_count);
		break;
	case SR_CONF_STREAM:
		/* Continuous USB stream (required for UI Loop/rolling) */
		*data = g_variant_new_boolean(TRUE);
		break;
	case SR_CONF_VTH:
		*data = g_variant_new_double(devc->vth);
		break;
	case SR_CONF_OPERATION_MODE:
		*data = g_variant_new_int16(devc->op_mode);
		break;
	case SR_CONF_CHANNEL_MODE:
		*data = g_variant_new_int16(devc->ch_mode);
		break;
	case SR_CONF_FILTER:
		*data = g_variant_new_int16(devc->filter);
		break;
	case SR_CONF_LOOP_MODE:
		*data = g_variant_new_boolean(devc->is_loop != 0);
		break;
	case SR_CONF_USB_SPEED:
		/* Actual cable/port link speed (for UI + low-speed warning). */
		*data = g_variant_new_int32((int32_t)devc->usb_speed);
		break;
	case SR_CONF_USB30_SUPPORT:
		/* Device silicon supports SuperSpeed. */
		*data = g_variant_new_boolean(ch32_usb30_capable());
		break;
	case SR_CONF_RLE:
		*data = g_variant_new_boolean(FALSE);
		break;
	case SR_CONF_RLE_SUPPORT:
		*data = g_variant_new_boolean(FALSE);
		break;
	default:
		return SR_ERR_NA;
	}
	return SR_OK;
}

static int config_set(int id, GVariant *data, struct sr_dev_inst *sdi,
		      struct sr_channel *ch,
		      struct sr_channel_group *cg)
{
	struct ch32_context *devc;
	const char *stropt;
	unsigned int i;

