Doukeyi-X/ALL-LOGIC/libsigrok4DSL/hardware/CH32/ch32_logic.c
	(void)cg;
	if (!sdi || !sdi->priv)
		return SR_ERR_ARG;
	devc = sdi->priv;

	switch (id) {
	case SR_CONF_DEVICE_MODE: {
		int16_t mode = g_variant_get_int16(data);
		if (mode != LOGIC && mode != ANALOG)
			return SR_ERR_ARG;
		if (sdi->mode == mode)
			break;
		sdi->mode = mode;
		if (mode == ANALOG) {
			ch32_setup_analog_probes(sdi);
			ch32_map_adc_samplerate(devc,
				devc->samplerate ? devc->samplerate : SR_MHZ(10));
			if (sdi->status == SR_ST_ACTIVE) {
				ch32_apply_adc_params(devc);
				ch32_apply_adc_channel(devc);
			}
			sr_info("switch mode → ANALOG (HSADC) ch=%u bit=%u div=%u rate=%" PRIu64,
				devc->adc_channel, devc->adc_bit, devc->adc_div,
				devc->samplerate);
		} else {
			ch32_setup_logic_probes(sdi);
			ch32_map_samplerate(devc,
				devc->samplerate ? devc->samplerate : SR_MHZ(100));
			if (sdi->status == SR_ST_ACTIVE) {
				ch32_apply_logic_params(devc);
				ch32_apply_level(devc);
			}
			sr_info("switch mode → LOGIC");
		}
		break;
	}
	case SR_CONF_SAMPLERATE:
		if (sdi->mode == ANALOG) {
			ch32_map_adc_samplerate(devc, g_variant_get_uint64(data));
			if (sdi->status == SR_ST_ACTIVE)
				ch32_apply_adc_params(devc);
			sr_info("ADC samplerate=%" PRIu64 " div=%u",
				devc->samplerate, devc->adc_div);
		} else {
			ch32_map_samplerate(devc, g_variant_get_uint64(data));
			if (sdi->status == SR_ST_ACTIVE)
				ch32_apply_logic_params(devc);
			sr_info("samplerate ui=%" PRIu64 " hw=%" PRIu64
				" sys=0x%02x decim=%d",
				devc->samplerate, devc->hw_samplerate,
				devc->logic_sys, devc->decimate_n);
		}
		break;
	case SR_CONF_LIMIT_SAMPLES:
		devc->limit_samples = g_variant_get_uint64(data);
		break;
	case SR_CONF_PROBE_EN:
		if (ch) {
			ch->enabled = g_variant_get_boolean(data);
			if (sdi->mode == ANALOG) {
				/* single active HW channel */
				if (ch->enabled) {
					GSList *l;
					for (l = sdi->channels; l; l = l->next) {
						struct sr_channel *o = l->data;
						if (o != ch && o->type == SR_CHANNEL_ANALOG)
							o->enabled = FALSE;
					}
					devc->adc_channel = (ch->index == 1) ? ADC_CH1 : ADC_CH0;
					if (sdi->status == SR_ST_ACTIVE)
						ch32_apply_adc_channel(devc);
				}
			}
		}
		break;
	case SR_CONF_PROBE_VDIV:
		if (ch)
			ch->vdiv = g_variant_get_uint64(data);
		break;
	case SR_CONF_PROBE_FACTOR:
		if (ch)
			ch->vfactor = g_variant_get_uint64(data);
		break;
	case SR_CONF_PROBE_COUPLING:
		if (ch)
			ch->coupling = g_variant_get_byte(data);
		break;
	case SR_CONF_PROBE_OFFSET:
		if (ch)
			ch->offset = g_variant_get_uint16(data);
		break;
	case SR_CONF_PROBE_HW_OFFSET:
		if (ch)
			ch->hw_offset = g_variant_get_uint16(data);
		break;
	case SR_CONF_PROBE_MAP_DEFAULT:
		if (ch)
			ch->map_default = g_variant_get_boolean(data);
		break;
	case SR_CONF_PROBE_MAP_UNIT:
		if (ch)
			ch->map_unit = g_variant_get_string(data, NULL);
		break;
	case SR_CONF_PROBE_MAP_MIN:
		if (ch)
			ch->map_min = g_variant_get_double(data);
		break;
	case SR_CONF_PROBE_MAP_MAX:
		if (ch)
			ch->map_max = g_variant_get_double(data);
		break;
	case SR_CONF_MAX_HEIGHT:
		stropt = g_variant_get_string(data, NULL);
		for (i = 0; i < ARRAY_SIZE(maxHeights); i++) {
			if (!strcmp(stropt, maxHeights[i])) {
				devc->max_height = (int)i;
				break;
			}
		}
		break;
	case SR_CONF_MAX_HEIGHT_VALUE:
		devc->max_height = g_variant_get_byte(data);
		break;
	case SR_CONF_VTH: {
		double v = g_variant_get_double(data);
		/* Hardware comparator range ≈ 1.2 V … 3.3 V (inverted DAC) */
		ch32_set_vth(devc, v);
		if (sdi->status == SR_ST_ACTIVE)
			ch32_apply_level(devc);
		else
			sr_info("VTH stored: %.2f V → DAC %u (apply on open/start)",
				devc->vth, (unsigned)devc->logic_level);
		break;
	}
	case SR_CONF_FILTER: {
		int nv = g_variant_get_int16(data);
		if (nv != SR_FILTER_NONE && nv != SR_FILTER_1T)
			return SR_ERR;
		devc->filter = nv;
		sr_info("filter -> %d", devc->filter);
		break;
	}
	case SR_CONF_CHANNEL_MODE: {
		int nv = g_variant_get_int16(data);
		if (nv != CH32_CHMODE_8 && nv != CH32_CHMODE_16)
			return SR_ERR;
		devc->ch_mode = nv;
		ch32_apply_channel_mode(sdi);
		/* USB2 max rate depends on 8/16-bit width */
		ch32_map_samplerate(devc, devc->samplerate);
		if (sdi->status == SR_ST_ACTIVE)
			ch32_apply_logic_params(devc);
		sr_info("channel mode -> %s (%d ch)",
			nv == CH32_CHMODE_8 ? "8" : "16",
			devc->channel_count);
		break;
	}
	case SR_CONF_OPERATION_MODE: {
		int nv = g_variant_get_int16(data);
		/* Hardware is always stream; only accept STREAM */
		if (nv != LO_OP_STREAM)
			return SR_ERR;
		devc->op_mode = LO_OP_STREAM;
		break;
	}
	case SR_CONF_LOOP_MODE:
		/* Rolling capture: keep USB stream past sample-limit */
		devc->is_loop = g_variant_get_boolean(data) ? 1 : 0;
		sr_info("loop/rolling mode -> %d", devc->is_loop);
		break;
	default:
		return SR_ERR_NA;
	}
	return SR_OK;
}

static int config_list(int key, GVariant **data, const struct sr_dev_inst *sdi,
		       const struct sr_channel_group *cg)
{
	GVariant *gvar;
	GVariantBuilder gvb;

	(void)sdi;
	(void)cg;

	switch (key) {
	case SR_CONF_DEVICE_OPTIONS:
		*data = g_variant_new_from_data(
			G_VARIANT_TYPE("ai"), hwoptions,
			ARRAY_SIZE(hwoptions) * sizeof(int32_t), TRUE, NULL, NULL);
		break;
	case SR_CONF_DEVICE_SESSIONS:
		*data = g_variant_new_from_data(
			G_VARIANT_TYPE("ai"), sessions,
			ARRAY_SIZE(sessions) * sizeof(int32_t), TRUE, NULL, NULL);
		break;
	case SR_CONF_SAMPLERATE: {
		static uint64_t rate_buf[128];
		int rate_n = 0;
		const struct ch32_context *devc =
			(sdi && sdi->priv) ? (const struct ch32_context *)sdi->priv
					   : NULL;

		if (devc && sdi->mode == ANALOG)
			ch32_build_adc_rate_list(rate_buf, &rate_n);
		else if (devc)
			ch32_build_rate_list(devc, rate_buf, &rate_n);
		else {
			memcpy(rate_buf, ch32_samplerate_list,
			       (size_t)ch32_samplerate_count * sizeof(uint64_t));
			rate_n = ch32_samplerate_count;
			rate_buf[rate_n] = 0;
		}
		g_variant_builder_init(&gvb, G_VARIANT_TYPE("a{sv}"));
		gvar = g_variant_new_from_data(
			G_VARIANT_TYPE("at"), rate_buf,
			(gsize)rate_n * sizeof(uint64_t),
			TRUE, NULL, NULL);
		g_variant_builder_add(&gvb, "{sv}", "samplerates", gvar);
		*data = g_variant_builder_end(&gvb);
		break;
	}
	case SR_CONF_PROBE_CONFIGS:
		*data = g_variant_new_from_data(
			G_VARIANT_TYPE("ai"), ch32_probe_options,
			ARRAY_SIZE(ch32_probe_options) * sizeof(int32_t),
			TRUE, NULL, NULL);
		break;
	case SR_CONF_PROBE_VDIV:
		*data = g_variant_new_from_data(
			G_VARIANT_TYPE("at"), ch32_vdivs,
			(ARRAY_SIZE(ch32_vdivs) - 1) * sizeof(uint64_t),
			TRUE, NULL, NULL);
		break;
	case SR_CONF_PROBE_COUPLING:
		*data = g_variant_new_strv(ch32_coupling, 2);
		break;
	case SR_CONF_PROBE_MAP_UNIT:
		*data = g_variant_new_strv(ch32_map_units, 1);
		break;
	case SR_CONF_MAX_HEIGHT:
		*data = g_variant_new_strv(maxHeights, ARRAY_SIZE(maxHeights));
		break;
	case SR_CONF_FILTER:
		*data = g_variant_new_uint64((uint64_t)&filter_list);
		break;
	case SR_CONF_CHANNEL_MODE:
		*data = g_variant_new_uint64((uint64_t)&channel_mode_list);
		break;
	case SR_CONF_OPERATION_MODE:
		*data = g_variant_new_uint64((uint64_t)&opmode_list);
		break;
	default:
		return SR_ERR_ARG;
	}
	return SR_OK;
}

