Doukeyi-X/ALL-LOGIC/libsigrok4DSL/hardware/CH32/ch32_logic.c
static int hw_dev_acquisition_start(struct sr_dev_inst *sdi, void *cb_data)
{
	struct ch32_context *devc = sdi->priv;
	const struct libusb_pollfd **lupfd;
	struct drv_context *drvc = di->priv;
	unsigned int i;
	int ret;

	(void)cb_data;

	if (sdi->status != SR_ST_ACTIVE) {
		ds_set_last_error(SR_ERR_DEVICE_CLOSED);
		return SR_ERR_DEVICE_CLOSED;
	}

	devc->sdi = sdi;
	devc->num_samples = 0;
	devc->num_bytes = 0;
	devc->abort = 0;
	devc->fw_streaming = 0;
	devc->status = CH32_ST_START;
	devc->freewheel = 0;
	devc->raw_pending_len = 0;
	devc->decimate_phase = 0;
	devc->filt_have_prev = 0;
	devc->stream_res_len = 0;
	devc->decim_win_fill = 0;
	devc->acq_analog = (sdi->mode == ANALOG) ? 1 : 0;
	/* residual half-sample only used on analog EP3 path */

	if (devc->acq_analog) {
		ch32_sync_adc_channel_from_probes(sdi);
		{
			GSList *l;
			int seen = 0;
			for (l = sdi->channels; l; l = l->next) {
				struct sr_channel *ch = l->data;
				if (ch->type != SR_CHANNEL_ANALOG)
					continue;
				if (ch->enabled) {
					if (seen)
						ch->enabled = FALSE;
					else {
						seen = 1;
						devc->adc_channel =
							(ch->index == 1) ? ADC_CH1 : ADC_CH0;
					}
				}
			}
			if (!seen && sdi->channels) {
				struct sr_channel *ch = sdi->channels->data;
				ch->enabled = TRUE;
				devc->adc_channel = ADC_CH0;
			}
		}
		sr_info("acq start ANALOG: ch=%u bit=%u div=%u rate=%" PRIu64
			" loop=%d limit=%" PRIu64,
			devc->adc_channel, devc->adc_bit, devc->adc_div,
			devc->samplerate, devc->is_loop, devc->limit_samples);
		if ((ret = ch32_apply_adc_params(devc)) != SR_OK)
			return ret;
		if ((ret = ch32_apply_adc_channel(devc)) != SR_OK)
			return ret;
	} else {
		ch32_apply_channel_mode(sdi);
		ch32_refresh_enabled_bits(devc);
		sr_info("acq start LOGIC: mode=%s logic_bit=%u en=%d ui_rate=%" PRIu64
			" hw_rate=%" PRIu64 " decim=%d filter=%d loop=%d limit=%" PRIu64,
			devc->ch_mode == CH32_CHMODE_8 ? "8ch" : "16ch",
			devc->logic_bit, devc->en_count,
			devc->samplerate, devc->hw_samplerate,
			devc->decimate_n, devc->filter,
			devc->is_loop, devc->limit_samples);
		if ((ret = ch32_apply_logic_params(devc)) != SR_OK)
			return ret;
		if ((ret = ch32_apply_level(devc)) != SR_OK)
			return ret;
	}

	if ((ret = start_transfers(devc)) != SR_OK) {
		sr_err("start_transfers failed");
		return ret;
	}

	/* event pump: freewheel on Windows (no pollfds) */
	lupfd = libusb_get_pollfds(drvc->sr_ctx->libusb_ctx);
	if (!lupfd) {
		devc->freewheel = 1;
		sr_session_source_add(-1, 0, 0, receive_data, sdi);
	} else {
		for (i = 0; lupfd[i]; i++) {
			sr_source_add(lupfd[i]->fd, lupfd[i]->events,
				      20, receive_data, sdi);
		}
		g_free((void *)lupfd);
	}

	if (devc->acq_analog)
		ret = ch32_cmd(devc, CMD_SET_ADC_START, NULL, 0, NULL, NULL);
	else
		ret = ch32_cmd(devc, CMD_SET_START, NULL, 0, NULL, NULL);
	if (ret != SR_OK) {
		devc->abort = 1;
		devc->fw_streaming = 0;
		return ret;
	}
	/* FW arms capture LED (usb_trans_flag) on START */
	devc->fw_streaming = 1;

	std_session_send_df_header(sdi, LOG_PREFIX);
	return SR_OK;
}

static int hw_dev_acquisition_stop(const struct sr_dev_inst *sdi, void *cb_data)
{
	struct ch32_context *devc;

	(void)cb_data;
	if (!sdi || !sdi->priv)
		return SR_ERR;

	devc = sdi->priv;
	/* Main-thread path: stop device immediately so LED goes out */
	ch32_hw_stop(devc);
	if (!devc->abort) {
		devc->abort = 1;
		devc->status = CH32_ST_STOP;
		ch32_cancel_transfers(devc);
		if (devc->submitted_transfers <= 0)
			finish_acquisition(devc);
	}
	return SR_OK;
}

SR_PRIV struct sr_dev_driver ch32_driver_info = {
	.name = "ch32-logic",
	.longname = "WCH CH32H417 Logic Analyzer / HSADC",
	.api_version = 1,
	.driver_type = DRIVER_TYPE_HARDWARE,
	.init = hw_init,
	.cleanup = hw_cleanup,
	.scan = hw_scan,
	.dev_mode_list = hw_dev_mode_list,
	.config_get = config_get,
	.config_set = config_set,
	.config_list = config_list,
	.dev_open = hw_dev_open,
	.dev_close = hw_dev_close,
	.dev_destroy = hw_dev_destroy,
	.dev_status_get = hw_dev_status_get,
	.dev_acquisition_start = hw_dev_acquisition_start,
	.dev_acquisition_stop = hw_dev_acquisition_stop,
	.priv = NULL,
};
